tap "2mawi2/tap"
tap "azure/functions"
tap "blendle/blendle"
tap "goodwithtech/r"
tap "hashicorp/tap"
tap "isen-ng/dotnet-sdk-versions"
tap "jandedobbeleer/oh-my-posh"
tap "microsoft/mssql-release"
tap "mike-engel/jwt-cli"
tap "mongodb/brew"
tap "thoughtbot/formulae"
brew "adr-tools"
brew "avro-tools"
brew "aztfexport"
brew "python@3.13"
brew "azure-cli"
brew "baobab"
brew "bat"
brew "node"
brew "ccusage"
brew "claude-code-router"
brew "cmake"
brew "colima"
brew "coreutils"
brew "gnu-sed"
brew "crosstool-ng"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "dos2unix"
brew "duti"
brew "eza"
brew "fzf"
brew "gcovr"
brew "gh"
brew "git"
brew "git-delta"
brew "glab"
brew "gnupg"
brew "go"
brew "hadolint"
brew "helm"
brew "helmfile"
brew "htop"
brew "imagemagick"
brew "infracost"
brew "jq"
brew "k9s"
brew "kube-linter"
brew "kubent"
brew "kubernetes-cli"
brew "lazygit"
brew "libfido2"
brew "lsd"
brew "markdownlint-cli2"
brew "minikube"
brew "mongosh"
brew "nuget"
brew "nvm"
brew "openssh"
brew "oras"
brew "pandoc"
brew "pipx"
brew "pv"
brew "redis"
brew "repomix"
brew "ripgrep"
brew "shellcheck"
brew "sonar-scanner"
brew "tectonic"
brew "terraform"
brew "tokei"
brew "tree"
brew "trivy"
brew "yarn"
brew "ykman"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "azure/functions/azure-functions-core-tools@4"
brew "blendle/blendle/kns"
brew "goodwithtech/r/dockle"
brew "hashicorp/tap/packer"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "microsoft/mssql-release/mssql-tools18"
brew "mike-engel/jwt-cli/jwt-cli"
brew "mongodb/brew/mongodb-database-tools"
brew "thoughtbot/formulae/complexity"
cask "adobe-acrobat-reader"
cask "affinity-designer"
cask "claude-code"
cask "clockify"
cask "codex"
cask "discord"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk10"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk10-0-100"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk6-0-400"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk7-0-400"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8-0-100"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8-0-400"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk9"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk9-0-300"
cask "firefox"
cask "flutter"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "gimp"
cask "git-credential-manager"
cask "goldencheetah"
cask "headlamp"
cask "inkscape"
cask "insomnia"
cask "jetbrains-toolbox"
cask "logitech-options"
cask "mactex"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "nvidia-geforce-now"
cask "privileges"
cask "raycast"
cask "redis-insight"
cask "2mawi2/tap/schaltwerk"
cask "slack"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "aliasadidev.nugetpackagemanagergui"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "azurite.azurite"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cmstead.js-codeformer"
vscode "cmstead.jsrefactor"
vscode "continue.continue"
vscode "csharpier.csharpier-vscode"
vscode "danishsarwar.reverse-search"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devcenter.ms-devbox"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eraserlabs.eraserlabs"
vscode "ericadamski.carbon-now-sh"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "fakesharper.fakesharper"
vscode "formulahendry.dotnet-test-explorer"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "htmlhint.vscode-htmlhint"
vscode "humao.rest-client"
vscode "jfrog.jfrog-vscode-extension"
vscode "johnpapa.angular2"
vscode "joshuapoehls.json-escaper"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mindaro-dev.file-downloader"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-apimanagement"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "msjsdiag.debugger-for-edge"
vscode "mskelton.one-dark-theme"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "robbos.copilot-token-tracker"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "yocto-project.yocto-bitbake"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "sigs.k8s.io/kind"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "elfloader"
cargo "nerdfix"
